---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceIsNoLongerVertical
source: html/3ec9c4d7-b9b0-61b0-9250-e104781e5d31.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceIsNoLongerVertical Property

Face defining this vertical Wall is no longer vertical.

## Syntax (C#)
```csharp
public static FailureDefinitionId FaceIsNoLongerVertical { get; }
```